let books = [
    {
        id: 1,
        name: "Американський психопат",
        image: "media\\1.jpg",
        description: "Патрік Бейтмен — привабливий, доглянутий та ерудований молодий чоловік. Він успішний інвестиційний банкір, який працює на Волл-стріт і має розкішну квартиру. Патрік стежить за модою, попмузикою та полюбляє пліткувати зі своїми друзями в елітних ресторанах Мангеттена. Його життя — справжня американська мрія. Однак це лише вдень. Уночі сором’язливий і трохи боягузливий чоловік перетворюється на звіра, який залюбки мучить людей та вбиває їх у вкрай збочені способи. Як далеко заведе його власне шаленство? І чи насмілиться хтось його зупинити? ЦІНА:350",
        category: "жахи",
    },
    {
        id: 2,
        name: "хімія смерті",
        image: "media\\2.jpg",
        description: "Судовий антрополог Девід Гантер утратив дружину і дочку. Покинувши роботу, він переїздить до містечка Менем та влаштовується на посаду терапевта. Ніхто з нових знайомих і гадки не має про минуле Девіда. Здається, його життя потихеньку повертається у спокійне русло. Поки місцеві хлопці не знаходять на болоті тіло вбитої жінки. Згодом зникає ще одна жінка, а за кілька днів знаходять і її понівечене тіло. Схоже, в Менемі з’явився серійний убивця. У містечку наростає тривога. Мешканці підозрюють одне одного у скоєному. Девід не може стояти осторонь та втягується в розслідування. До того ж остання зникла - нова знайома Девід ЦІНА:400 ",
        category: "детективи",
    },
    {
        id: 3,
        name: "Багряні ріки",
        image: "media\\3.jpg",
        description: "Симпатичний та атмосферний детективний трилер, знятий за мотивами однойменного роману Жан-Крістофа Гранже. В центрі сюжету історія вже немолодого детектива поліції П'єра Німана. Він добіса добрий детектив, один з кращих. Розумний і хоробрий, за словом в кишеню не полізе. ЦІНА:420",
        category: "детективи",
    },
    {
        id: 4,
        name: "Мовчання ягнят",
        image: "media\\4.jpg",
        description: "У пошуках серійного вбивці, який знімає шкіру зі своїх жертв, ФБР звертається за допомогою до відомого злочинця – Ганнібала Лектера, що перебуває в ізоляторі психлікарні. Він погоджується взяти участь у пошуках убивці, але за однієї умови – він хоче грати. Два маніяки, дві сповіді. ЦІНА:350",
        category: "детективи",
    },
    {
        id: 5,
        name: "Воно",
        image: "media\\5.jpg",
        description: "роман американського письменника Стівена Кінга, написаний у жанрі жахів, уперше опублікований 1986 року видавництвом Viking Press. У творі зачіпаються важливі для Кінга теми: влада пам'яті, сила в об'єднанні, вплив травм дитинства на доросле життя. ЦІНА:350",
        category: "жахи",
    },
    {
        id: 6,
        name: "Сяйво",
        image: "media\\6.jpg",
        description: "Коли Торранси найнялися доглядати взимку за розкішним готелем, вони й гадки не мали, який невимовний жах чекає на них... Одного разу там скоїлася страшна трагедія: колишній доглядач зарубав сокирою власну родину. Саме тут п’ятирічний Денні дізнався, що він може бачити справжніх мешканців будинку. І це — привиди. Хлопчику, наділеному даром передбачення, відкривається страшна суть речей. Він уже знає, звідки його родині загрожує смерть... ЦІНА:455",
        category: "жахи",
    },
    {
        id: 7,
        name: "Гітлер",
        image: "media\\7.jpg",
        description: "Подіям минулого століття присвячено тисячі тонн історичних розвідок, але тим не менше досі можна почути думку про те, що справжня історія ХХ століття ще не написана.Справді, до сьогодні немає зрозумілих відповідей на питання хто розв’язав Першу світову війну, чому сталася Жовтнева революція у Росії, які справжні причини Другої світової війни.Долучитися до пошуку відповідей на них намагається і автор у пропонованій нині книзі. Жахи війни не мають виправдання, але нетиповий для вітчизняних праць кут зору допоможе глибше і масштабніше осягнути буремний період європейської і світової історії та зробити важливі для сьогодення висновки. ЦІНА:350",
        category: "фантастика",
    },
    {
        id: 8,
        name: "Будинок дивних дітей",
        image: "media\\8.jpg",
        description: "«Дім дивних дітей» — химерна маленька книжка з чорно-білими світлинами. Книга про подорож у часі, дітей, здатних на чарівні речі, та про жахливих чудовиськ. <...> А справжнім завданням першої частини — створення будови цього світу, введення концепції світу з безліччю часових контурів та дивних дітей. ЦІНА:400",
        category: "фантастика",
    },
    {
        id: 9,
        name: "Із крові та попелу",
        image: "media\\9.jpg",
        description: "Пенеллафі Балфур, вона ж Маківка — не просто осиротіла донька багатіїв, наближених до королівської родини, а ще й Діва. Діву роками готують до важливого релігійного ритуалу, глибоко шанують і ревно стережуть, тож Маківка виросла в достатку й має все, крім особистої свободи.Вона скута жорсткими рамками правил, але нишком порушує їх усі: навчається бойових мистецтв, допомагає тим, кому пощастило менше, потай вибирається на прогулянки до міста й не тільки. Під час однієї з таких прогулянок Маківка, сховавшись під маскою, зустрічає прекрасного незнайомця. Той плутає її зі служницею, з якою в нього побачення, — розвага, про яку Діві навіть мріяти не можна.Невдовзі цей прекрасний незнайомець опиняється в замку, де живе Маківка, і стає... її новим особистим охоронцем. Дівчина, звісно, шокована. Однак це — лише початок неймовірних пригод, які спонукають її засумніватися майже в усьому, що вона знає про людство. ЦІНА:500",
        category: "фантастика",
    },
    {
        id: 10,
        name: "Убивство у «Східному експресі»",
        image: "media\\10.jpg",
        description: "Бельгійський детектив Еркюль Пуаро мусить терміново виїхати зі Стамбула до Англії, але вільних місць у «Східному експресі» вже немає. Його виручає давній друг мсьє Бук, власник компанії, якій належить поїзд. Зранку за сніданком детектив помічає, що пасажири експреса — люди різних національностей, які випадково опинилися в одному вагоні. Американець Ретчетт, що видається Пуаро надто підозрілим, просить детектива стати його охоронцем. Але той відмовляється. Уночі Пуаро весь час будять різні звуки й стукіт, та потім настає тиша — через снігові замети поїзд зупинився десь у Югославії, пасажири напружені, а дивний містер Ретчетт лежить мертвий у своєму купе... Детектив Пуаро береться до розслідування. ЦІНА:350",
        category: "детективи",
    },
    {
        id: 11,
        name: "Клуб убивств по четвергах»",
        image: "media\\11.jpg",
        description: "Маленьке, віддалене від гамірних мегаполісів містечко Куперс-Чейз — затишне поселення для шанованих пенсіонерів. Ані турбот, ані негод, суцільна ідилія. Щочетверга четверо стареньких збираються в кімнаті для відпочинку, щоб... обговорити старі нерозкриті вбивства, звісна річ. Принаймні так було доти, доки одного з місцевих не знайшли мертвим — і тепер «Клуб убивств по четвергах» починає своє перше справжнє розслідування. Поважний вік не має шансів проти їхнього завзяття, адже час копирсатися в старих могилах та проливати світло на чужих демонів! І хоча ніхто з детективів-аматорів цього поки не підозрює, та що глибше вони копатимуть, то більше витягуватимуть на поверхню власних таємниць. ЦІНА:350",
        category: "детективи",
    }

]


function loadProducts(category, priceLower, priceHigher) {
    let container = document.getElementById("container");
    let innerHtmlContainer = "";
    let booksFiltered = [];
    if (category) {
        booksFiltered = books.filter(elem => elem.category === category);
    } else {
        booksFiltered = books;
    }
    booksFiltered.forEach(elem => {
        let elemHtml = `<div class="elem-card"><div class="leftside"><image width="20%" src="${elem.image}"/></div><div class="rightside"><h4 class="cardtitle">${elem.name}</h4><p>${elem.description}</p></div></div>`;
        innerHtmlContainer += elemHtml;
    });
    container.innerHTML = innerHtmlContainer;
}


setTimeout(() => {
    let container = document.getElementById("navbar");
    container.innerHTML = "Please like and subscribe";
}, 5000)

document.addEventListener("DOMContentLoaded", function () {
    var subscriptionOffer = document.getElementById('subscriptionOffer');
    var acceptButton = document.getElementById('acceptButton');
    var rejectButton = document.getElementById('rejectButton');


    function showSubscriptionOffer() {
        subscriptionOffer.style.display = 'block';
    }


    function hideSubscriptionOffer() {
        subscriptionOffer.style.display = 'none';
    }


    if (!localStorage.getItem('subscriptionAccepted')) {
        showSubscriptionOffer();
    }


    acceptButton.addEventListener('click', function () {
        localStorage.setItem('subscriptionAccepted', true);
        hideSubscriptionOffer();
    });

    rejectButton.addEventListener('click', function () {
        hideSubscriptionOffer();
    });
});

const modal = document.getElementById('modal');
const modalOverlay = document.getElementById('modal-overlay');
const closeButton = document.getElementById('close-btn');
const closeTimeout = 5000;


function showModal() {
    modal.style.display = 'block';
    modalOverlay.style.display = 'block';
}


function closeModal() {
    modal.style.display = 'none';
    modalOverlay.style.display = 'none';
}


closeButton.addEventListener('click', closeModal);


let timer = setTimeout(() => {
    closeButton.textContent = "Close";
    closeButton.style.color = "#000";
    closeButton.addEventListener('click', closeModal);
}, closeTimeout);


modal.addEventListener('click', () => {
    clearTimeout(timer);
    timer = setTimeout(() => {
        closeButton.textContent = "Close";
        closeButton.style.color = "#000";
        closeButton.addEventListener('click', closeModal);
    }, closeTimeout);
});


showModal();